"""
1 задача - easy

Напиши функцию, get_tx_count(address: str, chain_id: int, days: int) -> int:
которая принимает на вход адрес, id блокчейна и количество дней.
Функция должна вернуть количество транзакций сделанных кошельком за последние <days> дней.

"""

# будут добавлены позже

"""

2 задача - medium

Напишите функцию get_stargate_volume(address: str, chain_id: int) -> float:
которая принимает на вход адрес и id блокчейна.
Функция должна вернуть объем всех транзакций сделанных кошельком через мост Stargate за все время в 
указанной сети. Должны считаться только стейблкоины USDC и USDT.

Скрипт минимально должен работать в сети Ethereum, Arbitrum, Optimism.

"""


# будут добавлены позже

"""
3 задача - hard

Напишите функцию get_stargate_volume(address: str, chain_ids: list[int]) -> float:
которая принимает на вход адрес и список id блокчейнов
Функция должна вернуть объем всех транзакций сделанных кошельком через мост Stargate за все время в 
указанных сетях. Должны считаться нативные токены по сегодняшнему курсу и стейблкоины USDC и USDT.

Скрипт должен работать в сети Ethereum, Arbitrum, Optimism и Polygon.

"""

# будут добавлены позже
и



