"""
1 задача - easy

Напишите скрипт, который считает переводы токенов USDT в сети Ethereum за последние 30 дней
по переданному адресу


"""

# решение 1 задачи

"""

2 задача - medium
Напишите скрипт, который считает статистику сколько было врапнуто эфира за последние 5 дней


"""


# решение 2 задачи

"""
3 задача - hard
Напишите скрипт, который считает объем в USD по переводу токенов через мост Stargate за последние 30 дней
по переданному адресу, учитывая ETH, USDC и USDT.
Должен работать в сети Ethereum, через запрос логов транзакций.

"""

# решение 3 задачи



