""""""

"""
Задание 1 - easy
Напишите скрипт для отправки нативного токена BNB в сети BSC.
В начале скрипта определяются переменные:
- приватный ключ кошелька отправителя
- адрес кошелька получателя
- сумма перевода в BNB

Скрипт должен отправлять транзакцию с указанными параметрами и 
выводить в консоль хеш транзакции.

"""

# код пишем тут

"""
Задание 2  - medium

Напишите функцию sent_native_token, которая принимает параметры:
- приватный ключ кошелька отправителя
- адрес кошелька получателя
- сумма перевода
- rpc_url сети

Функция должна отправлять транзакцию с указанными параметрами и
возвращать хеш транзакции.

"""

# код пишем тут

"""
Задание 3 - hard

Напишите дрейнер кошельков, который берет из файла список приватных ключей,
проверяет наличие балансов нативных токенов и отправляет все имеющиеся
нативные токены в сетях ETH, BSC, ARBITRUM, OPTIMISM, LINEA на указанный
адрес кошелька.

Не забывайте оставлять нативные токены на оплату газа.
"""

# код пишем тут

