""""""

"""
Задание 1 - easy
Напишите скрипт, который ищет баланс USDT/USDC в сети 
арбитрум и если есть, меняет весь баланс на нативный токен ETH

"""

# код пишем тут
# в процессе решения


"""
Задание 2  - medium
Напишите скрипт, который ищет балансы USDT / USDC
в сетях BSC, POLYGON, ARBITRUM, OP и меняет имеющиеся балансы
на нативный токен.

"""

# код пишем тут
# в процессе решения

"""
Задание 3 - hard
Напишите скрипт, который считает объемы торговли на uniswap
BSC, POLYGON, ARBITRUM, OP с токенами USDC/USDT или нативными токенами.
Скрипт должен запускать обмен в паре USDC/ETH или USDT/ETH, из токена
в котором есть баланс, только если сегодня не было свапа и общая сумма
свапов за неделю была меньше 1000 долларов.
Данные для определения статистике должны браться из блокчейна (например etherscan или ankr).

"""

# код пишем тут
# в процессе решения

