""""""

"""
Задание 1 - easy

Напишите какие команды используются при обмене USDC на ETH через версию пула 3.
Напишите код новых команд и их названия.
Какие значения содержаться в инпутах новых команд.
* Посмотрите в коде контракта.

"""

# код пишем тут

"""
Задание 2  - medium
Определите и напишите в каких ситуациях не используется PayPortion и Sweep.
Какие проверки необходимо сделать в функции swap, чтобы не использовать эти команды.
Напишите код определяющий необходимость использования этих команд.

"""

# код пишем тут

"""
Задание 3 - hard
Напишите скрипт, который проверяет транзакции в контракте Uniswap Router за последние сутки,
находит транзакции execute и подсчитывает какой набор команд использовался.
Скрипт должен вывести в консоли все используемые команды при execute и их количество.
Вывод должен быть отсортирован по количеству использований команд.
Пример вывода:
0x0b000604 - 1246
0x0a000604 - 845
0x000604 - 586
и т.д.
Скрипт должен выводить статистику, какие наборы команд использовались чаще всего.
Воспользуйтесь API Etherscan.
"""

# код пишем тут

