""""""
import time
from pprint import pprint

"""
Задание 1 - easy
Создайте класс Chain, который будет иметь 3 атрибута: 
name
okx_name
binance_name

Создайте класс Chains, который будет хранить в себе список объектов класса Chain.
Создайте объекты сетей для сетей:
- Binance Smart Chain
- Ethereum
- Polygon
- Arbitrum One
- Optimism
- Avalanche
- Solana

Укажите корректные названия для сетей на биржах Binance и OKX.

"""

# пишите код здесь


"""
Задание 2 - medium

Скрипт вывода токенов с биржи OKX.
Напишите скрипт, который берет кошельки из файла wallets.txt и с паузой в 60-1200 секунд
пополняет их токеном ETH в сети Arbitrum на сумму от 0.01 до 0.1 ETH, округляя до 3 знаков после запятой.
Кошельки должны пополниться по 1 разу, но в рандомном порядке.
Можете использовать любой способ работы с api: запросы, SDK, ccxt.
"""

# пишите код здесь


"""
Задание 3 - hard

Выберите одну из бирж, которая вас интересует (например Bybit, Mexc и т.д.) и создайте 
класс клиента на примере классов для OKX и Binance.

Должны быть реализованы методы:
- получения информации о токенах и сетях
- вывода токена с биржи
- получения статуса вывода

Для реализации можете использовать любой способ работы с api: запросы, SDK, ccxt.
"""


# пишите код здесь
