""""""

"""
Задание 1 - easy
Напишите скрипт, который отправляет запрос на Binance при помощи requests и
выводит в консоль баланс токена ETH на spot аккаунте биржи.

"""

# код пишем тут

"""
Задание 2  - medium

Напишите скрипт, который берет кошельки из файла wallets.txt и с паузой в 60-1200 секунд
пополняет их токеном ETH в сети Arbitrum на сумму от 0.01 до 0.1 ETH, округляя до 3 знаков после запятой.
Кошельки должны пополниться по 1 разу, но в рандомном порядке.
Можете использовать любой способ работы с api: запросы, SDK, ccxt.
"""

# код пишем тут

"""
Задание 3 - hard

Напишите скрипт, который берет кошельки из файла wallets.txt и с рандомной паузой 
пополняет на 10-30$ в нативном токене одну из сетей: Binance Smart Chain, Ethereum, Polygon, Arbitrum,
Optimism, Avalanche. 
Кошельки должны пополниться по 1 разу за день, но в рандомном порядке.
Пауза между ними должна высчитываться из учета количества кошельков, чтобы они пополнялись
равномерно в течении дня, но с рандомными интервалами.
Можете использовать любой способ работы с api: запросы, SDK, ccxt.

"""

# код пишем тут

