""""""

"""
Задание 1 - medium

Напишите скрипт, который авторизуется на платформе https://bima.money/faucet с помощью подписи сообщения
и запросов.
1. Изучите запросы при подключении кошелька
2. Найдите запрос для получения временной метки и сообщения для подписи
3. Подпишите сообщение
4. Найдите запрос для авторизации
5. Отправьте запрос на авторизацию с подписью и временной меткой

Внимательно смотрите на заголовки запросов, они могут быть важными для авторизации.

Итоговый запрос на ****/wallet/connect должен вернуть ответ содержащий errmsg:"no error"

"""


# код пишем тут
