""""""

"""
Задание 1 - easy

Напишите скрипт, который запускает браузер,
открывает расширение метамаска, авторизуется в кошельке,
выбирает сеть Linea для работы.

"""

# код пишем тут

"""
Задание 2  - medium

Напишите функцию select_chain, которая принимает на вход:
- страницу браузера
- название сети

Функция должна выбирать сеть в кошельке метамаск.


"""

# код пишем тут

"""
Задание 3 - hard
Напишите функцию set_chain, которая принимает на вход :
- страницу браузера
- название сети
- словарь с параметрами сети: rpc, chain_id, native_token

Функция должна создавать сеть, если ее нет в списке сетей, и выбирать ее.
"""

# код пишем тут

