""""""

"""
Задание 1 - easy

Напишите код, который находит все видимые кнопки на странице и в цикле нажимает на каждую из них.

"""

# код пишем тут

"""
Задание 2  - medium
Напишите скрипт заходит на сайт https://localapi-doc-en.adspower.com/,
и собирает адреса всех ссылок на странице в список, после чего переходит по каждой ссылке.

"""


# код пишем тут

"""
Задание 3 - hard
Напишите скрипт, который переходит на сайт https://pancakeswap.finance/info/v3
и собирает информацию о каждом токене из списка Top Tokens в список словарей:
{
    "number": "4",
    "name": "Ethereum Token",
    "price": "$3.15K",
    "price_change": "↑0.04%",
    "volume_24h": "$36.76M",
    "TVL": "$34.87M",
    "link": "https://pancakeswap.finance/info/v3/tokens/0x2170ed0880ac9a755fd29b2688956bd959f933f8"
}
"""



# код пишем тут

