""""""

"""
Задание 1 - easy
Напишите скрипт, который берёт приватные ключи из файла private_keys.txt и
отправляет USDC токен из сети Arbitrum в сеть Optimism через мост Stargate,
в режиме taxi с прикреплением 0,001 ETH  gas on destination.
"""

# в процессе решения

"""
Задание 2  - medium

Напишите скрипт, который должен перевести рандомную сумму нативного токена ETH
из сети Arbitrum в сеть Optimism через мост Stargate, в режиме taxi,
скрипт должен считать количество запущенных аккаунтов и разделить
аккаунты так, чтобы все аккаунты отработали за 7 дней.

"""

# в процессе решения

"""
Задание 3 - hard
Переделайте скрипт таким образом, чтобы скрипт отрабатывал только  
20 рандомныха акаунтов в день, равномерно распределяя
их по дню, при этом скрипт должен продолжать работать по лимиту,
даже если его перезапустят, не превышая лимит в 20 аккаунтов в день.
Все данные должны браться из ончейн данных (например, через ankr / etherscan).
Каждый аккаунт должен отработать только 1 раз.
"""

# в процессе решения

