""""""

"""
Задание 1 - easy
Напишите какие инпуты принимают команды PayPortion и Sweep.
Посмотрите в коде контракта, логику если указаны данные команды и
какие инпуты они принимают, по каким переменным раскладываются.
Перечислите названия данных которые передаются в инпутах.
Попробуйте определить зачем нужны эти команды, напишите своими словами.
"""

# код пишем тут todo написать решение

"""
Задание 2  - medium
Данное задание не использует uniswap, данное задание про понимание обернутых токенов.
Напишите 2 функции:
wrapETH(chain: Chain, amount: Amount) и
unwrapETH(chain: Chain, amount: Amount)
Функции должны при помощи контракта WETH в выбранной сети оборачивать и разворачивать
токен ETH в WETH и наоборот.
Например в сети арбитрум через контракт https://arbiscan.io/token/0x82af49447d8a07e3bd95bd0d56f35241523fbab1
wrapETH при помощи функции deposit() оборачивает ETH в WETH,
unwrapETH при помощи функции withdraw() разворачивает WETH в ETH.

"""

# код пишем тут todo написать решение

"""
Задание 3 - hard

Выясните и напишите, в каких случаях в команде 00 используется payer_is_user = true, а в каких false.
Обновите функцию get_swap_data, чтобы значение payer_is_user менялось автоматически.
"""

# код пишем тут todo написать решение

