""""""

"""
Задание 1 - easy

Прочитайте за что отвечает параметр slow_mo в методе connect_over_cdp 
https://playwright.dev/python/docs/next/api/class-browsertype#browser-type-connect-over-cdp

Будьте осторожны с вкладкой у которой в url offscreen, данную вкладку нельзя закрывать и нельзя
использовать для перехода по ссылкам, это техническая вкладка, игнорируйте ее. Некоторые
расширения имеют технические скрытые вкладки.

"""

# код пишем тут

"""
Задание 2  - medium

Напишите метод keyboard_input для класса ADS, данный метод должен принимать:
- локатор текстового поля
- текст который нужно ввести в поле

Метод должен вводить текст в поле посимвольно с паузой от 0.1 до 0.5 секунды.
Пауза между каждым символом должна быть случайной.

"""
# код пишем тут


"""
Задание 3  - hard

Напишите метод keyboard_input для класса ADS, данный метод должен принимать:
- локатор текстового поля
- текст который нужно ввести в поле

Метод должен вводить текст в поле посимвольно с паузой от 0.1 до 0.5 секунды.
Пауза между каждым символом должна быть случайной.
Метод должен иногда допускать ошибки, вводя случайные символы вместо нужных,
после чего должен удалять ошибочный символ и вводить правильный.

""""""

# код пишем тут
""""""

Задание 4  - hard

Напишите скрипт, который будет открывать страницу https://pancakeswap.finance,
Открывать всплывающее окно выбора сетей и выбирать рандомную сеть.

"""

# код пишем тут





