""""""

"""
Задание 1 - easy

Напишите функцию на Python, которая генерирует случайный симметричный ключ 
для шифрования и расшифрования данных и печатает в терминале. Используйте библиотеку cryptography.

"""

# код пишем тут


"""
Задание 2  - medium

Напишите функцию на Python, которая шифрует переданные ей данные и возвращает
зашифрованную строку. Используйте библиотеку cryptography.
Функция принимает:
- строку для шифрования
- ключ для шифрования
Возвращает зашифрованную строку.

"""

# код пишем тут


"""
Задание 3 - medium

Напишите функцию на Python, которая дешифрует переданные ей данные и возвращает
зашифрованную строку. Используйте библиотеку cryptography.
Функция принимает:
- строку для дешифрования
- ключ для дешифрования
Возвращает расшифрованную строку.
"""

# код пишем тут


"""
Задание 4 - hard

Напишите скрипт, который берет из текстового файла список паролей и шифрует их при помощи библиотеки cryptography.
Ключ должен браться из связки ключей системы с помощью библиотеки keyring.
Зашифрованные пароли должны записываться в новый файл.
"""

# код пишем тут

